src/addons/metaservice/src/test/queries/getWsdl.query

<?xml version="1.0" encoding="utf-8"?>
<!-- MessageTestCase opens an input stream to this file and fails the test if it cannot parse this file.
     The file contents are not used for anything-->
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xroad="http://x-road.eu/xsd/xroad.xsd"
    xmlns:id="http://x-road.eu/xsd/identifiers">
  <SOAP-ENV:Header>
    <xroad:client id:objectType="MEMBER">
      <id:xRoadInstance>EE</id:xRoadInstance>
      <id:memberClass>BUSINESS</id:memberClass>
      <id:memberCode>consumer</id:memberCode>
    </xroad:client>
    <xroad:service id:objectType="SERVICE">
      <id:xRoadInstance>EE</id:xRoadInstance>
      <id:memberClass>BUSINESS</id:memberClass>
      <id:memberCode>producer</id:memberCode>
      <id:serviceCode>getWsdl</id:serviceCode>
    </xroad:service>
    <xroad:userId>EE:PIN:abc4567</xroad:userId>
    <xroad:id>411d6755661409fed365ad8135f8210be07613da</xroad:id>
    <xroad:issue/>
    <xroad:protocolVersion>4.0</xroad:protocolVersion>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <xroad:getWsdl>
      <xroad:serviceCode>getRandom</xroad:serviceCode>
    </xroad:getWsdl>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
